docs/20230306 - steve vai test results/1200_configmaps_load_steve_new_pagination_baseline_image_c-m-5qf7r4z7_cluster_results.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./load_steve_new_pagination.js
     output: -

  scenarios: (100.00%) 1 scenario, 10 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 10 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 10 VUs  0d00h00m00.9s/24h0m0s  000/300 iters, 30 per VU

running (0d00h00m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 10 VUs  0d00h00m01.9s/24h0m0s  000/300 iters, 30 per VU

running (0d00h00m03.0s), 10/10 VUs, 2 complete and 0 interrupted iterations
list   [   1% ] 10 VUs  0d00h00m02.9s/24h0m0s  002/300 iters, 30 per VU

running (0d00h00m04.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
list   [   3% ] 10 VUs  0d00h00m03.9s/24h0m0s  010/300 iters, 30 per VU

running (0d00h00m05.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
list   [   3% ] 10 VUs  0d00h00m04.9s/24h0m0s  010/300 iters, 30 per VU

running (0d00h00m06.0s), 10/10 VUs, 15 complete and 0 interrupted iterations
list   [   5% ] 10 VUs  0d00h00m05.9s/24h0m0s  015/300 iters, 30 per VU

running (0d00h00m07.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
list   [   7% ] 10 VUs  0d00h00m06.9s/24h0m0s  020/300 iters, 30 per VU

running (0d00h00m08.0s), 10/10 VUs, 24 complete and 0 interrupted iterations
list   [   8% ] 10 VUs  0d00h00m07.9s/24h0m0s  024/300 iters, 30 per VU

running (0d00h00m09.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
list   [  10% ] 10 VUs  0d00h00m08.9s/24h0m0s  030/300 iters, 30 per VU

running (0d00h00m10.0s), 10/10 VUs, 33 complete and 0 interrupted iterations
list   [  11% ] 10 VUs  0d00h00m09.9s/24h0m0s  033/300 iters, 30 per VU

running (0d00h00m11.0s), 10/10 VUs, 36 complete and 0 interrupted iterations
list   [  12% ] 10 VUs  0d00h00m10.9s/24h0m0s  036/300 iters, 30 per VU

running (0d00h00m12.0s), 10/10 VUs, 42 complete and 0 interrupted iterations
list   [  14% ] 10 VUs  0d00h00m11.9s/24h0m0s  042/300 iters, 30 per VU

running (0d00h00m13.0s), 10/10 VUs, 45 complete and 0 interrupted iterations
list   [  15% ] 10 VUs  0d00h00m12.9s/24h0m0s  045/300 iters, 30 per VU

running (0d00h00m14.0s), 10/10 VUs, 49 complete and 0 interrupted iterations
list   [  16% ] 10 VUs  0d00h00m13.9s/24h0m0s  049/300 iters, 30 per VU

running (0d00h00m15.0s), 10/10 VUs, 56 complete and 0 interrupted iterations
list   [  19% ] 10 VUs  0d00h00m14.9s/24h0m0s  056/300 iters, 30 per VU

running (0d00h00m16.0s), 10/10 VUs, 56 complete and 0 interrupted iterations
list   [  19% ] 10 VUs  0d00h00m15.9s/24h0m0s  056/300 iters, 30 per VU

running (0d00h00m17.0s), 10/10 VUs, 61 complete and 0 interrupted iterations
list   [  20% ] 10 VUs  0d00h00m16.9s/24h0m0s  061/300 iters, 30 per VU

running (0d00h00m18.0s), 10/10 VUs, 66 complete and 0 interrupted iterations
list   [  22% ] 10 VUs  0d00h00m17.9s/24h0m0s  066/300 iters, 30 per VU

running (0d00h00m19.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
list   [  23% ] 10 VUs  0d00h00m18.9s/24h0m0s  070/300 iters, 30 per VU

running (0d00h00m20.0s), 10/10 VUs, 76 complete and 0 interrupted iterations
list   [  25% ] 10 VUs  0d00h00m19.9s/24h0m0s  076/300 iters, 30 per VU

running (0d00h00m21.0s), 10/10 VUs, 77 complete and 0 interrupted iterations
list   [  26% ] 10 VUs  0d00h00m20.9s/24h0m0s  077/300 iters, 30 per VU

running (0d00h00m22.0s), 10/10 VUs, 82 complete and 0 interrupted iterations
list   [  27% ] 10 VUs  0d00h00m21.9s/24h0m0s  082/300 iters, 30 per VU

running (0d00h00m23.0s), 10/10 VUs, 87 complete and 0 interrupted iterations
list   [  29% ] 10 VUs  0d00h00m22.9s/24h0m0s  087/300 iters, 30 per VU

running (0d00h00m24.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
list   [  30% ] 10 VUs  0d00h00m23.9s/24h0m0s  090/300 iters, 30 per VU

running (0d00h00m25.0s), 10/10 VUs, 96 complete and 0 interrupted iterations
list   [  32% ] 10 VUs  0d00h00m24.9s/24h0m0s  096/300 iters, 30 per VU

running (0d00h00m26.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
list   [  33% ] 10 VUs  0d00h00m25.9s/24h0m0s  100/300 iters, 30 per VU

running (0d00h00m27.0s), 10/10 VUs, 103 complete and 0 interrupted iterations
list   [  34% ] 10 VUs  0d00h00m26.9s/24h0m0s  103/300 iters, 30 per VU

running (0d00h00m28.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
list   [  37% ] 10 VUs  0d00h00m27.9s/24h0m0s  110/300 iters, 30 per VU

running (0d00h00m29.0s), 10/10 VUs, 111 complete and 0 interrupted iterations
list   [  37% ] 10 VUs  0d00h00m28.9s/24h0m0s  111/300 iters, 30 per VU

running (0d00h00m30.0s), 10/10 VUs, 116 complete and 0 interrupted iterations
list   [  39% ] 10 VUs  0d00h00m29.9s/24h0m0s  116/300 iters, 30 per VU

running (0d00h00m31.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
list   [  40% ] 10 VUs  0d00h00m30.9s/24h0m0s  120/300 iters, 30 per VU

running (0d00h00m32.0s), 10/10 VUs, 123 complete and 0 interrupted iterations
list   [  41% ] 10 VUs  0d00h00m31.9s/24h0m0s  123/300 iters, 30 per VU

running (0d00h00m33.0s), 10/10 VUs, 128 complete and 0 interrupted iterations
list   [  43% ] 10 VUs  0d00h00m32.9s/24h0m0s  128/300 iters, 30 per VU

running (0d00h00m34.0s), 10/10 VUs, 133 complete and 0 interrupted iterations
list   [  44% ] 10 VUs  0d00h00m33.9s/24h0m0s  133/300 iters, 30 per VU

running (0d00h00m35.0s), 10/10 VUs, 136 complete and 0 interrupted iterations
list   [  45% ] 10 VUs  0d00h00m34.9s/24h0m0s  136/300 iters, 30 per VU

running (0d00h00m36.0s), 10/10 VUs, 138 complete and 0 interrupted iterations
list   [  46% ] 10 VUs  0d00h00m35.9s/24h0m0s  138/300 iters, 30 per VU

running (0d00h00m37.0s), 10/10 VUs, 145 complete and 0 interrupted iterations
list   [  48% ] 10 VUs  0d00h00m36.9s/24h0m0s  145/300 iters, 30 per VU

running (0d00h00m38.0s), 10/10 VUs, 148 complete and 0 interrupted iterations
list   [  49% ] 10 VUs  0d00h00m37.9s/24h0m0s  148/300 iters, 30 per VU

running (0d00h00m39.0s), 10/10 VUs, 153 complete and 0 interrupted iterations
list   [  51% ] 10 VUs  0d00h00m38.9s/24h0m0s  153/300 iters, 30 per VU

running (0d00h00m40.0s), 10/10 VUs, 156 complete and 0 interrupted iterations
list   [  52% ] 10 VUs  0d00h00m39.9s/24h0m0s  156/300 iters, 30 per VU

running (0d00h00m41.0s), 10/10 VUs, 158 complete and 0 interrupted iterations
list   [  53% ] 10 VUs  0d00h00m40.9s/24h0m0s  158/300 iters, 30 per VU

running (0d00h00m42.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
list   [  53% ] 10 VUs  0d00h00m41.9s/24h0m0s  160/300 iters, 30 per VU

running (0d00h00m43.0s), 10/10 VUs, 168 complete and 0 interrupted iterations
list   [  56% ] 10 VUs  0d00h00m42.9s/24h0m0s  168/300 iters, 30 per VU

running (0d00h00m44.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
list   [  57% ] 10 VUs  0d00h00m43.9s/24h0m0s  170/300 iters, 30 per VU

running (0d00h00m45.0s), 10/10 VUs, 173 complete and 0 interrupted iterations
list   [  58% ] 10 VUs  0d00h00m44.9s/24h0m0s  173/300 iters, 30 per VU

running (0d00h00m46.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
list   [  60% ] 10 VUs  0d00h00m45.9s/24h0m0s  180/300 iters, 30 per VU

running (0d00h00m47.0s), 10/10 VUs, 181 complete and 0 interrupted iterations
list   [  60% ] 10 VUs  0d00h00m46.9s/24h0m0s  181/300 iters, 30 per VU

running (0d00h00m48.0s), 10/10 VUs, 183 complete and 0 interrupted iterations
list   [  61% ] 10 VUs  0d00h00m47.9s/24h0m0s  183/300 iters, 30 per VU

running (0d00h00m49.0s), 10/10 VUs, 191 complete and 0 interrupted iterations
list   [  64% ] 10 VUs  0d00h00m48.9s/24h0m0s  191/300 iters, 30 per VU

running (0d00h00m50.0s), 10/10 VUs, 193 complete and 0 interrupted iterations
list   [  64% ] 10 VUs  0d00h00m49.9s/24h0m0s  193/300 iters, 30 per VU

running (0d00h00m51.0s), 10/10 VUs, 196 complete and 0 interrupted iterations
list   [  65% ] 10 VUs  0d00h00m50.9s/24h0m0s  196/300 iters, 30 per VU

running (0d00h00m52.0s), 10/10 VUs, 204 complete and 0 interrupted iterations
list   [  68% ] 10 VUs  0d00h00m51.9s/24h0m0s  204/300 iters, 30 per VU

running (0d00h00m53.0s), 10/10 VUs, 206 complete and 0 interrupted iterations
list   [  69% ] 10 VUs  0d00h00m52.9s/24h0m0s  206/300 iters, 30 per VU

running (0d00h00m54.0s), 10/10 VUs, 207 complete and 0 interrupted iterations
list   [  69% ] 10 VUs  0d00h00m53.9s/24h0m0s  207/300 iters, 30 per VU

running (0d00h00m55.0s), 10/10 VUs, 214 complete and 0 interrupted iterations
list   [  71% ] 10 VUs  0d00h00m54.9s/24h0m0s  214/300 iters, 30 per VU

running (0d00h00m56.0s), 10/10 VUs, 217 complete and 0 interrupted iterations
list   [  72% ] 10 VUs  0d00h00m55.9s/24h0m0s  217/300 iters, 30 per VU

running (0d00h00m57.0s), 10/10 VUs, 221 complete and 0 interrupted iterations
list   [  74% ] 10 VUs  0d00h00m56.9s/24h0m0s  221/300 iters, 30 per VU

running (0d00h00m58.0s), 10/10 VUs, 226 complete and 0 interrupted iterations
list   [  75% ] 10 VUs  0d00h00m57.9s/24h0m0s  226/300 iters, 30 per VU

running (0d00h00m59.0s), 10/10 VUs, 231 complete and 0 interrupted iterations
list   [  77% ] 10 VUs  0d00h00m58.9s/24h0m0s  231/300 iters, 30 per VU

running (0d00h01m00.0s), 10/10 VUs, 233 complete and 0 interrupted iterations
list   [  78% ] 10 VUs  0d00h00m59.9s/24h0m0s  233/300 iters, 30 per VU

running (0d00h01m01.0s), 10/10 VUs, 236 complete and 0 interrupted iterations
list   [  79% ] 10 VUs  0d00h01m00.9s/24h0m0s  236/300 iters, 30 per VU

running (0d00h01m02.0s), 10/10 VUs, 238 complete and 0 interrupted iterations
list   [  79% ] 10 VUs  0d00h01m01.9s/24h0m0s  238/300 iters, 30 per VU

running (0d00h01m03.0s), 10/10 VUs, 241 complete and 0 interrupted iterations
list   [  80% ] 10 VUs  0d00h01m02.9s/24h0m0s  241/300 iters, 30 per VU

running (0d00h01m04.0s), 10/10 VUs, 248 complete and 0 interrupted iterations
list   [  83% ] 10 VUs  0d00h01m03.9s/24h0m0s  248/300 iters, 30 per VU

running (0d00h01m05.0s), 10/10 VUs, 251 complete and 0 interrupted iterations
list   [  84% ] 10 VUs  0d00h01m04.9s/24h0m0s  251/300 iters, 30 per VU

running (0d00h01m06.0s), 10/10 VUs, 256 complete and 0 interrupted iterations
list   [  85% ] 10 VUs  0d00h01m05.9s/24h0m0s  256/300 iters, 30 per VU

running (0d00h01m07.0s), 10/10 VUs, 261 complete and 0 interrupted iterations
list   [  87% ] 10 VUs  0d00h01m06.9s/24h0m0s  261/300 iters, 30 per VU

running (0d00h01m08.0s), 10/10 VUs, 261 complete and 0 interrupted iterations
list   [  87% ] 10 VUs  0d00h01m07.9s/24h0m0s  261/300 iters, 30 per VU

running (0d00h01m09.0s), 10/10 VUs, 266 complete and 0 interrupted iterations
list   [  89% ] 10 VUs  0d00h01m08.9s/24h0m0s  266/300 iters, 30 per VU

running (0d00h01m10.0s), 10/10 VUs, 271 complete and 0 interrupted iterations
list   [  90% ] 10 VUs  0d00h01m09.9s/24h0m0s  271/300 iters, 30 per VU

running (0d00h01m11.0s), 10/10 VUs, 271 complete and 0 interrupted iterations
list   [  90% ] 10 VUs  0d00h01m10.9s/24h0m0s  271/300 iters, 30 per VU

running (0d00h01m12.0s), 10/10 VUs, 271 complete and 0 interrupted iterations
list   [  90% ] 10 VUs  0d00h01m11.9s/24h0m0s  271/300 iters, 30 per VU

running (0d00h01m13.0s), 10/10 VUs, 281 complete and 0 interrupted iterations
list   [  94% ] 10 VUs  0d00h01m12.9s/24h0m0s  281/300 iters, 30 per VU

running (0d00h01m14.0s), 10/10 VUs, 282 complete and 0 interrupted iterations
list   [  94% ] 10 VUs  0d00h01m13.9s/24h0m0s  282/300 iters, 30 per VU

running (0d00h01m15.0s), 10/10 VUs, 286 complete and 0 interrupted iterations
list   [  95% ] 10 VUs  0d00h01m14.9s/24h0m0s  286/300 iters, 30 per VU

running (0d00h01m16.0s), 09/10 VUs, 291 complete and 0 interrupted iterations
list   [  97% ] 10 VUs  0d00h01m15.9s/24h0m0s  291/300 iters, 30 per VU

running (0d00h01m17.0s), 02/10 VUs, 298 complete and 0 interrupted iterations
list   [  99% ] 10 VUs  0d00h01m16.9s/24h0m0s  298/300 iters, 30 per VU

running (0d00h01m17.1s), 00/10 VUs, 300 complete and 0 interrupted iterations
list ✓ [ 100% ] 10 VUs  0d00h01m17.0s/24h0m0s  300/300 iters, 30 per VU

     ✓ /v1/configmaps returns status 200

     █ setup

       ✓ /v3-public/localProviders/local?action=login returns status 200

   ✓ checks.........................: 100.00% ✓ 4201      ✗ 0   
     data_received..................: 5.4 GB  71 MB/s
     data_sent......................: 8.8 MB  115 kB/s
     http_req_blocked...............: avg=19.55µs  min=0s       med=0s      max=11.38ms  p(95)=1µs      p(99)=1µs     count=4201
     http_req_connecting............: avg=2.27µs   min=0s       med=0s      max=1.15ms   p(95)=0s       p(99)=0s      count=4201
     http_req_duration..............: avg=173.62ms min=1.82ms   med=96.83ms max=2.21s    p(95)=958.09ms p(99)=1.6s    count=4201
       { expected_response:true }...: avg=173.62ms min=1.82ms   med=96.83ms max=2.21s    p(95)=958.09ms p(99)=1.6s    count=4201
     http_req_failed................: 0.00%   ✓ 0         ✗ 4201
     http_req_receiving.............: avg=28.8ms   min=10µs     med=21.57ms max=316.57ms p(95)=77.55ms  p(99)=93.75ms count=4201
     http_req_sending...............: avg=22.19µs  min=10µs     med=20µs    max=191µs    p(95)=37µs     p(99)=65µs    count=4201
     http_req_tls_handshaking.......: avg=16.75µs  min=0s       med=0s      max=10.36ms  p(95)=0s       p(99)=0s      count=4201
     http_req_waiting...............: avg=144.8ms  min=1.79ms   med=65.34ms max=2.12s    p(95)=910.28ms p(99)=1.52s   count=4201
     http_reqs......................: 4201    54.486399/s
     iteration_duration.............: avg=2.53s    min=125.11ms med=2.47s   max=3.67s    p(95)=3.33s    p(99)=3.59s   count=301 
     iterations.....................: 300     3.890959/s
     vus............................: 2       min=2       max=10
     vus_max........................: 10      min=10      max=10